src/cf/Catalogs/РезультатыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РезультатыЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХарактерРезультата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерыРезультатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ХарактерыРезультатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ХарактерыРезультатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нейтральный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отрицательный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Положительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоложительныйСЗамечаниями</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/РезультатыЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет поставляемые данные.
// 
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	
	РезультатЗадачОбъект = Зарегистрировано.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Зарегистрировано'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = Исполнено.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Исполнено'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Нейтральный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = НеЗарегистрировано.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Не зарегистрировано'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = НеПодписано.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Не подписано'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = НеСогласовано.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Не согласовано'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = НеУтверждено.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Не утверждено'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = Ознакомлены.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Ознакомлены'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Нейтральный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = ОтмененоПриглашение.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Отменено приглашение'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = Подписано.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Подписано'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = ПодтвержденоПриглашение.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Подтверждено приглашение'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = Рассмотрено.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Рассмотрено'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Нейтральный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = Согласовано.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Согласовано'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = СогласованоСЗамечаниями.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Согласовано с замечаниями'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.ПоложительныйСЗамечаниями;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
	РезультатЗадачОбъект = Утверждено.ПолучитьОбъект();
	РезультатЗадачОбъект.Наименование = НСтр("ru = 'Утверждено'");
	РезультатЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатЗадачОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
    МультиязычностьСервер.ОбработкаПолученияДанныхВыбора(ДанныеВыбора, 
    Параметры, СтандартнаяОбработка, Метаданные.Справочники.РезультатыЗадач);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
